
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 97 to add, 0 to change, 27 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.apim_kv_policy
  * azurerm_key_vault_access_policy.policy
  * azurerm_resource_group.rg
  * module.cft_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-cft-client-id&#34;]
  * module.cft_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-cft-client-pwd&#34;]
  * module.crime_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-client-id&#34;]
  * module.crime_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;crime-apim-cert&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;crime-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;elinks-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;elinks-client-token&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;health-check-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-cert-base-64&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-cert-password&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-emulator-ctx&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-emulator-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-gateway-scope&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-servicenow-auth&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-servicenow-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-scope&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-assignment-group&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-caller-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-password&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-role-type&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-service-offering&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-username&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;tenant-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-pwd&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-libra-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;mi-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;sa-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;sa-name&#34;]
  * module.kv_cft.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_cft.azurerm_key_vault_access_policy.developer[0]
  * module.kv_cft.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_crime.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_crime.azurerm_key_vault_access_policy.developer[0]
  * module.kv_crime.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_hmi.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_hmi.azurerm_key_vault_access_policy.developer[0]
  * module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;4800c310-cd45-4e90-9cf9-857bd0e33759&#34;]
  * module.kv_hmi.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_rota.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_rota.azurerm_key_vault_access_policy.developer[0]
  * module.kv_rota.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_snl.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_snl.azurerm_key_vault_access_policy.developer[0]
  * module.kv_snl.azurerm_key_vault_access_policy.product_team_access_policy
  * module.sa.azapi_update_resource.defender_settings
  * module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-snl-client-id&#34;]
  * module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-snl-client-pwd&#34;]
* Replace
  * azurerm_application_insights.libra_dtu_app_insights
  * azurerm_application_insights.rota_dtu_app_insights
  * azurerm_automation_account.automation_account
  * azurerm_role_assignment.mi_sa[&#34;Contributor&#34;]
  * azurerm_role_assignment.mi_sa[&#34;Storage Blob Data Contributor&#34;]
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.kv_cft.azurerm_key_vault.kv
  * module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_crime.azurerm_key_vault.kv
  * module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi.azurerm_key_vault.kv
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_key_vault.kv
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_snl.azurerm_key_vault.kv
  * module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Reader&#34;]
  * module.sa.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.libra_dtu_app_insights must be replaced
-/+ resource "azurerm_application_insights" "libra_dtu_app_insights" {
      ~ app_id                                = "bdbf8a55-014e-49b9-88f3-76bd75230406" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Insights/components/hmi-libra-dtu-stg" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "hmi-libra-dtu-stg"
      ~ resource_group_name                   = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        tags                                  = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_application_insights.rota_dtu_app_insights must be replaced
-/+ resource "azurerm_application_insights" "rota_dtu_app_insights" {
      ~ app_id                                = "174b42aa-9d95-47b6-aca1-6a129d720ef3" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Insights/components/hmi-rota-dtu-stg" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "hmi-rota-dtu-stg"
      ~ resource_group_name                   = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        tags                                  = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_automation_account.automation_account must be replaced
-/+ resource "azurerm_automation_account" "automation_account" {
      ~ dsc_primary_access_key        = (sensitive value)
      ~ dsc_secondary_access_key      = (sensitive value)
      ~ dsc_server_endpoint           = "https://9c4d739b-558d-43ba-bb4f-581476f2060f.agentsvc.uks.azure-automation.net/accounts/9c4d739b-558d-43ba-bb4f-581476f2060f" -> (known after apply)
      ~ hybrid_service_url            = "https://9c4d739b-558d-43ba-bb4f-581476f2060f.jrds.uks.azure-automation.net/automationAccounts/9c4d739b-558d-43ba-bb4f-581476f2060f" -> (known after apply)
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa" -> (known after apply)
        name                          = "hmi-stg-aa"
      ~ private_endpoint_connection   = [] -> (known after apply)
      ~ resource_group_name           = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        tags                          = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (4 unchanged attributes hidden)

      ~ identity {
          ~ principal_id = "6725a3bd-bd35-499e-9e20-7d8e9e841916" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_key_vault_access_policy.apim_kv_policy will be created
  + resource "azurerm_key_vault_access_policy" "apim_kv_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = "86edbf4a-d5aa-4a70-8137-a41ae3e62a62"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "hmi-sharedinfra-sds-stg-rg"
    }

  # azurerm_role_assignment.mi_sa["Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "mi_sa" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/providers/Microsoft.Authorization/roleAssignments/d372bf1b-4a58-8f50-b38c-86227e862d93" -> (known after apply)
      ~ name                             = "d372bf1b-4a58-8f50-b38c-86227e862d93" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_sa["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "mi_sa" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/providers/Microsoft.Authorization/roleAssignments/5f72c791-c5bd-4944-60c1-78ec2bd2d745" -> (known after apply)
      ~ name                             = "5f72c791-c5bd-4944-60c1-78ec2bd2d745" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.schedule must be replaced
-/+ resource "azurerm_automation_job_schedule" "schedule" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/3a1006a8-92d2-45f4-ab74-e8b0925741bf" -> (known after apply)
      ~ job_schedule_id         = "3a1006a8-92d2-45f4-ab74-e8b0925741bf" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "resource_group_name"  = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg"
            # (11 unchanged elements hidden)
        }
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/456ca59c-d39b-4a69-b51d-410f916be0bc" -> (known after apply)
      ~ job_schedule_id         = "456ca59c-d39b-4a69-b51d-410f916be0bc" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "resource_group_name"  = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg"
            # (11 unchanged elements hidden)
        }
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_runbook.main must be replaced
-/+ resource "azurerm_automation_runbook" "main" {
      ~ id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/runbooks/rotate-sas-tokens-hmisastg-rota-rl" -> (known after apply)
      ~ job_schedule             = [
          - {
              - job_schedule_id = "3a1006a8-92d2-45f4-ab74-e8b0925741bf"
              - parameters      = {}
              - run_on          = ""
              - schedule_name   = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
            },
        ] -> (known after apply)
      - log_activity_trace_level = 0 -> null
        name                     = "rotate-sas-tokens-hmisastg-rota-rl"
      ~ resource_group_name      = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        tags                     = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule must be replaced
-/+ resource "azurerm_automation_schedule" "schedule" {
      ~ expiry_time             = "9999-12-31T23:59:00+00:00" -> (known after apply)
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule" -> (known after apply)
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
      ~ start_time              = "2023-11-23T01:00:00Z" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_schedule" "trigger_once" {
      ~ expiry_time             = "2023-11-22T13:55:00+00:00" -> (known after apply)
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger" -> (known after apply)
      + interval                = (known after apply)
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
      ~ start_time              = "2023-11-22T13:55:00Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.schedule must be replaced
-/+ resource "azurerm_automation_job_schedule" "schedule" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/0cca375f-7249-4e7f-90a5-331eecbb29ac" -> (known after apply)
      ~ job_schedule_id         = "0cca375f-7249-4e7f-90a5-331eecbb29ac" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "resource_group_name"  = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg"
            # (11 unchanged elements hidden)
        }
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/0d496d51-65ad-4f7a-8e32-175ba3b826ae" -> (known after apply)
      ~ job_schedule_id         = "0d496d51-65ad-4f7a-8e32-175ba3b826ae" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "resource_group_name"  = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg"
            # (11 unchanged elements hidden)
        }
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_runbook.main must be replaced
-/+ resource "azurerm_automation_runbook" "main" {
      ~ id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/runbooks/rotate-sas-tokens-hmisastg-rota-rlw" -> (known after apply)
      ~ job_schedule             = [
          - {
              - job_schedule_id = "0cca375f-7249-4e7f-90a5-331eecbb29ac"
              - parameters      = {}
              - run_on          = ""
              - schedule_name   = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
            },
        ] -> (known after apply)
      - log_activity_trace_level = 0 -> null
        name                     = "rotate-sas-tokens-hmisastg-rota-rlw"
      ~ resource_group_name      = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        tags                     = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule must be replaced
-/+ resource "azurerm_automation_schedule" "schedule" {
      ~ expiry_time             = "9999-12-31T23:59:00+00:00" -> (known after apply)
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule" -> (known after apply)
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
      ~ start_time              = "2023-11-23T01:00:00Z" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_schedule" "trigger_once" {
      ~ expiry_time             = "2023-11-22T13:55:00+00:00" -> (known after apply)
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger" -> (known after apply)
      + interval                = (known after apply)
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ resource_group_name     = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
      ~ start_time              = "2023-11-22T13:55:00Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cft_keyvault_bootstrap_secr

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

        - category = "AuditEvent" -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + enabled_log {
          + category = "AuditEvent"
        }

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.kv_snl.azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      ~ id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-snl" -> (known after apply)
        name                            = "hmi-kv-stg-shared-snl"
      ~ resource_group_name             = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
        tags                            = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      ~ vault_uri                       = "https://hmi-kv-stg-shared-snl.vault.azure.net/" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.kv_snl.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      ~ id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-snl|hmi-kv-stg-shared-snl" -> (known after apply)
      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
        name                           = "hmi-kv-stg-shared-snl"
      ~ target_resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-snl" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - enabled_log {
          - category = "AuditEvent" -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + enabled_log {
          + category = "AuditEvent"
        }

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.sa.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sa.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "storage-account-role-assignment" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/providers/Microsoft.Authorization/roleAssignments/e8ba88d8-04b7-4cce-533c-2a0dee17470e" -> (known after apply)
      ~ name                             = "e8ba88d8-04b7-4cce-533c-2a0dee17470e" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1" -> (known after apply)
      ~ scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      ~ id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "hmisastg"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://hmisastg.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "hmisastg.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://hmisastg.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "hmisastg.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://hmisastg.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "hmisastg.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://hmisastg.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "hmisastg.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://hmisastg.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "hmisastg.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://hmisastg.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "hmisastg.z33.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "hmi-sharedinfra-stg-rg" -> "hmi-sharedinfra-sds-stg-rg" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      ~ secondary_blob_connection_string  = (sensitive value)
      ~ secondary_blob_endpoint           = "https://hmisastg-secondary.blob.core.windows.net/" -> (known after apply)
      ~ secondary_blob_host               = "hmisastg-secondary.blob.core.windows.net" -> (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      ~ secondary_dfs_endpoint            = "https://hmisastg-secondary.dfs.core.windows.net/" -> (known after apply)
      ~ secondary_dfs_host                = "hmisastg-secondary.dfs.core.windows.net" -> (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      ~ secondary_location                = "ukwest" -> (known after apply)
      ~ secondary_queue_endpoint          = "https://hmisastg-secondary.queue.core.windows.net/" -> (known after apply)
      ~ secondary_queue_host              = "hmisastg-secondary.queue.core.windows.net" -> (known after apply)
      ~ secondary_table_endpoint          = "https://hmisastg-secondary.table.core.windows.net/" -> (known after apply)
      ~ secondary_table_host              = "hmisastg-secondary.table.core.windows.net" -> (known after apply)
      ~ secondary_web_endpoint            = "https://hmisastg-secondary.z33.web.core.windows.net/" -> (known after apply)
      ~ secondary_web_host                = "hmisastg-secondary.z33.web.core.windows.net" -> (known after apply)
        tags                              = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (18 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-snl-client-id"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "hmi-snl-client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-snl-client-pwd"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "hmi-snl-client-pwd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 97 to add, 0 to change, 27 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Vars":{}} -->